---
kind: property
id: P:Autodesk.Revit.DB.CombinableElementArray.IsEmpty
source: html/2d4e7268-af37-4771-ba49-34d7c90ae39f.htm
---
# Autodesk.Revit.DB.CombinableElementArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.